export const sigDefaultColors: { [key: string]: string } = {
  資安: "rgba(35, 135, 200, 0.5)", // 資安
  資訊程式設計: "rgba(35, 135, 200, 0.5)", // 資訊程式設計
  機器人設計與製造: "rgba(35, 135, 200, 0.5)", // 機器人設計與製造
  建築設計: "rgba(35, 135, 200, 0.5)", // 建築設計
  生科動科與環境: "rgba(0, 170, 115, 0.5)", // 生科動科與環境
  醫學: "rgba(0, 170, 115, 0.5)", // 醫學
  醫學相關: "rgba(0, 170, 115, 0.5)", // 醫學相關
  法政: "rgba(160, 100, 55, 0.5)", // 法政
  社心教育: "rgba(160, 100, 55, 0.5)", // 社心教育
  音樂表藝: "rgba(250, 170, 190, 0.5)", // 音樂表藝
  大眾傳播: "rgba(250, 170, 190, 0.5)", // 大眾傳播
  文史哲: "rgba(250, 170, 190, 0.5)", // 文史哲
  財經: "rgba(160, 100, 55, 0.5)", // 財經
  無人機: "rgba(35, 135, 200, 0.5)", // 無人機
  經濟與管理管科: "rgba(250, 170, 190, 0.5)", // 經濟與管理管科
  元宇宙: "rgba(250, 170, 190, 0.5)", // 元宇宙
  直播: "rgba(250, 170, 190, 0.5)", // 直播
  科學教育: "rgba(35, 135, 200, 0.5)", // 科學教育
  雲端: "rgba(35, 135, 200, 0.5)", // 雲端
  遊憩運動: "rgba(35, 135, 200, 0.5)", // 遊憩運動
  電機物理: "rgba(35, 135, 200, 0.5)", // 電機物理
};

export const sigDefaultBorderColors: { [key: string]: string } = {
  資安: "rgb(35, 135, 200)", // 資安
  資訊程式設計: "rgb(35, 135, 200)", // 資訊程式設計
  機器人設計與製造: "rgb(35, 135, 200)", // 機器人設計與製造
  建築設計: "rgb(35, 135, 200)", // 建築設計
  生科動科與環境: "rgb(0, 170, 115)", // 生科動科與環境
  醫學: "rgb(0, 170, 115)", // 醫學
  醫學相關: "rgb(0, 170, 115)", // 醫學相關
  法政: "rgb(160, 100, 55)", // 法政
  社心教育: "rgb(160, 100, 55)", // 社心教育
  音樂表藝: "rgb(250, 170, 190)", // 音樂表藝
  大眾傳播: "rgb(250, 170, 190)", // 大眾傳播
  文史哲: "rgb(250, 170, 190)", // 文史哲
  財經: "rgb(160, 100, 55)", // 財經
  無人機: "rgb(35, 135, 200)", // 無人機
  經濟與管理管科: "rgb(250, 170, 190)", // 經濟與管理
  元宇宙: "rgb(250, 170, 190)", // 元宇宙
  直播: "rgb(250, 170, 190)", // 直播
  科學教育: "rgb(35, 135, 200)", // 科學教育
  雲端: "rgb(35, 135, 200)", // 雲端
  遊憩運動: "rgb(35, 135, 200)", // 遊憩運動
  電機物理: "rgb(35, 135, 200)", // 電機物理
};
