export const sigDefaultColors: { [key: string]: string } = {
  "651799ebfa1d45d97b139864": "rgb(35, 135, 200)", // 資安
  "6529ed87df4ae96f279cd5e3": "rgb(35, 135, 200)", // 資訊程式設計
  "6529ee3cdf4ae96f279cd5e4": "rgb(35, 135, 200)", // 機器人設計與製造
  "6529ee57df4ae96f279cd5e5": "rgb(35, 135, 200)", // 建築設計
  "6529eed9df4ae96f279cd5e6": "rgb(0, 170, 115)", // 生科動科與環境
  "6529eeeddf4ae96f279cd5e7": "rgb(0, 170, 115)", // 醫學
  "6529efbfdf4ae96f279cd5ec": "rgb(0, 170, 115)", // 醫學相關
  "6529efe9df4ae96f279cd5ee": "rgb(160, 100, 55)", // 法政
  "6529effbdf4ae96f279cd5ef": "rgb(160, 100, 55)", // 社心教育
  "6529f011df4ae96f279cd5f0": "rgb(250, 170, 190)", // 音樂表藝
  "6529f05ddf4ae96f279cd5f1": "rgb(250, 170, 190)", // 大眾傳播
  "6529f06edf4ae96f279cd5f2": "rgb(250, 170, 190)", // 文史哲
  "6529f07ddf4ae96f279cd5f3": "rgb(160, 100, 55)", // 財經
  "6529f094df4ae96f279cd5f4": "rgb(35, 135, 200)", // 無人機
  "6529f0a2df4ae96f279cd5f5": "rgb(250, 170, 190)", // 經濟與管理
  "6529f0c4df4ae96f279cd5f6": "rgb(250, 170, 190)", // 元宇宙
  "6529f0dbdf4ae96f279cd5f7": "rgb(250, 170, 190)", // 直播
  "6529f0eedf4ae96f279cd5f8": "rgb(35, 135, 200)", // 科學教育
  "652b851ca1bd096e024475c4": "rgb(35, 135, 200)", // 雲端
};
